# 2차원 데이터
# dictionary 데이터
import pandas as pd
# 웹스크래핑, 공공데이터, 공공테이터csv, xls
data = {
    '이름' : ['강나래', '강태원', '강호림', '김수찬', '김재욱', '박동현', '박혜정', '승근열'],
    '학교' : ['구로고', '구로고', '구로고', '구로고', '구로고', '디지털고', '디지털고', '디지털고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}

# dic데이터를 출력
print(data)
print(data['이름'])
print(type(data))

# pandas 2차원데이터로 변환
df = pd.DataFrame(data)
print(type(df))
print(df)

print(df['이름'])
print(df['키'])
print(df[['이름','키','국어','영어']])   #df -> 8개 컬럼이 모두 있음. 4개만 출력
df = pd.DataFrame(data,columns=['이름','키','국어','영어']) # df -> 4개만 있음.
print(df)
print(df['학교'])
# print(df[['이름','키']     ])


